{"_id":{"$oid":"590ec8609538cd26b8627e97"},"title":"WISH \u0026 SNEAKERBOY TO RELEASE ADIDAS CONSORTIUM SNEAKER EXCHANGE PUREBOOST \u0026 CLIMACOOL","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/wish-sneakerboy-adidas-consortium-sneaker-exhange-summary.jpg","author":"titivuk","content":"Sneakerboy has made a huge impact in the world of sneakers in their relatively short time outfitting Australia with the latest heat, and now they’ll collaborate with veterans Wish ATL through adidas Consortium’s ongoing world tour. The two global footwear connoisseurs have never teamed up before but now have the three stripes to thank for this coming jellyfish-inspired adidas Pure Boost and adidas ClimaCOOL each slated to release globally on May 20th, 2017.Sneakerboy’s stores are all located on the Australian Coast and the shop took inspiration from the world’s deadliest jellyfish and its translucent glow in the dark qualities for a truly hypnotizing take on the Pure Boost and ClimaCool silhouettes. Each takes an updated Primeknit woven approach with lime green luminescence to reference a similar jellyfish breed showcased at the Georgia Aquarium down the road from Wish ATL. Both retail locations will have early dibs on their project, with a release via Sneakerboy.com and WishATL.com dropping the duo on May 13th. Check out more detailed shots of the coming adidas Consortium collaboration with WISH ATL and Sneakerboy Australia below and head over to our Release Dates page for more coming offerings from the three stripes.","summary":"Sneakerboy has made a huge impact in the world of sneakers in their relatively short time outfitting Australia with the latest heat, and now they’ll collaborate with veterans Wish ATL through adidas Consortium’s ongoing world tour. The two global footwear connoisseurs have never teamed up before but now have the three stripes to thank for this coming jellyfish-inspired adidas Pure Boost and adidas ClimaCOOL each slated to release globally on May 20th, 2017.Sneakerboy’s stores are all located on the Australian Coast and the shop took inspiration from the world’s deadliest jellyfish and its tran","createdAt":{"$date":"2017-05-07T07:10:24.376Z"},"tags":["adidas"," collab"," climacool"," pureboost"],"__v":0}
{"_id":{"$oid":"590ec89f9538cd26b8627e98"},"title":"AIR JORDAN 1 FLYKNIT “BANNED” RELEASING THIS YEAR","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/air-jordan-1-flyknit.jpg","author":"titivuk","content":"It was only a matter of time before Nike’s most prized innovation of the 21st century would make its way on one of the most iconic basketball sneakers of all-time. The Air Jordan 1 Flyknit will indeed release this year in the “Banned” colorway, seen here during a Spurs/Blazers Playoffs game in Portland. The Jordan MTM Pack in 2015 came close as the Air Jordan 1 from that Pack was built with the new Flyweave material, but the true Flyknit version is what sneakerheads have been waiting for. Stay tuned for release updates.","summary":"It was only a matter of time before Nike’s most prized innovation of the 21st century would make its way on one of the most iconic basketball sneakers of all-time. The Air Jordan 1 Flyknit will indeed release this year in the “Banned” colorway, seen here during a Spurs/Blazers Playoffs game in Portland. The Jordan MTM Pack in 2015 came close as the Air Jordan 1 from that Pack was built with the new Flyweave material, but the true Flyknit version is what sneakerheads have been waiting for. Stay tuned for release updates.","createdAt":{"$date":"2017-05-07T07:11:27.869Z"},"tags":["jordan"," flyknit"," banned"],"__v":0}
{"_id":{"$oid":"590ec8db9538cd26b8627e99"},"title":"PUMA UNVEILS NETFIT IN NYC WITH USAIN BOLT, YANDE, YESJULZ, AND MORE","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/puma-netfit-event.jpg","author":"titivuk","content":"Last night, PUMA set up shop at NYC’s Altman Building in Flatiron to present to the world their all-new NETFIT innovation (you can read more about it here). The event was hosted by Miami’s YesJulz, a social media socialite and Puma brand ambassador, and featured the world’s fastest man Usain Bolt, who helped launch the new product. After the presentation, event invitees were given a chance to try the new NetFit shoes for themselves in the Lace Lab.The PUMA NETFIT Collection will release throughout Summer 2017 with the Puma 365 evoKNIT NETFIT launching June 1st, the Puma Ignite Netfit in exclusive women’s colorways launching July 1st alongside the likes of the Puma Tsugi NETFIT, the Puma Ignite Limitless NETFIT, and the PUMA evoSPEED Indoor NETFIT. The Puma Ignite Netfit is available now on Puma.","summary":"Last night, PUMA set up shop at NYC’s Altman Building in Flatiron to present to the world their all-new NETFIT innovation (you can read more about it here). The event was hosted by Miami’s YesJulz, a social media socialite and Puma brand ambassador, and featured the world’s fastest man Usain Bolt, who helped launch the new product. After the presentation, event invitees were given a chance to try the new NetFit shoes for themselves in the Lace Lab.The PUMA NETFIT Collection will release throughout Summer 2017 with the Puma 365 evoKNIT NETFIT launching June 1st, the Puma Ignite Netfit in exclus","createdAt":{"$date":"2017-05-07T07:12:27.856Z"},"tags":["puma"," news"],"__v":0}
{"_id":{"$oid":"590ec9099538cd26b8627e9a"},"title":"AIR JORDAN 11 LOW “HEIRESS” RETURNS IN FROST WHITE","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/air-jordan-11-low-heiress-release-details-897331-100-01.jpg","author":"titivuk","content":"Summer is on the horizon, so you know what that means: even more Air Jordan 11 Low colorways are set to arrive at retailers in the near future. Jordan Brand continues to revamp and overhaul their grade school girl’s lineup with premium materials and unique exclusive colorways to catch the young fashionista’s eye, and the Air Jordan 11 Low “Heiress” has to be among the best yet. The Jordan 11 Low Heiress benefits from a premium Frost White leather upper, a brand new cracked midsole made to look like synthetic crocodile skin, and a translucent white outsole unit to match. All of these features come together for a clean, luxurious take on one of the most prolific Jordan summer retros. Will you be grabbing a pair? Check out more detailed shots of the coming grade school girl’s exclusive Jordan 11 Low offering below and stay updated on our latest Air Jordan Release Dates right here on Sneaker News.","summary":"Summer is on the horizon, so you know what that means: even more Air Jordan 11 Low colorways are set to arrive at retailers in the near future. Jordan Brand continues to revamp and overhaul their grade school girl’s lineup with premium materials and unique exclusive colorways to catch the young fashionista’s eye, and the Air Jordan 11 Low “Heiress” has to be among the best yet. The Jordan 11 Low Heiress benefits from a premium Frost White leather upper, a brand new cracked midsole made to look like synthetic crocodile skin, and a translucent white outsole unit to match. All of these features c","createdAt":{"$date":"2017-05-07T07:13:13.422Z"},"tags":["jordanxii"," jordan"],"__v":0}
{"_id":{"$oid":"590ec92f9538cd26b8627e9b"},"title":"NEW BALANCE HONORS THE ENGLISH REGION OF CUMBRIA","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/new-balance-770-cumbria-pack-1.jpg","author":"titivuk","content":"New Balance drops a trio of premium models manufactured at their Cumbria, UK factory, and honors the region itself with striking colorways inspired by the region’s flag. The CT300 court shoe, the lesser-seen 770, and the popular 1500 all get the high-quality build, featuring premium leather, suede, and textiles in bright white, royal, green color combinations and completed with the Cumbrian flag on each tongue as well as the insole graphics. The New Balance “Cumbrian Pack” begins releasing at finer New Balance retailers globally on May 6th.","summary":"New Balance drops a trio of premium models manufactured at their Cumbria, UK factory, and honors the region itself with striking colorways inspired by the region’s flag. The CT300 court shoe, the lesser-seen 770, and the popular 1500 all get the high-quality build, featuring premium leather, suede, and textiles in bright white, royal, green color combinations and completed with the Cumbrian flag on each tongue as well as the insole graphics. The New Balance “Cumbrian Pack” begins releasing at finer New Balance retailers globally on May 6th.","createdAt":{"$date":"2017-05-07T07:13:51.676Z"},"tags":["newbalance"," nb"],"__v":0}
{"_id":{"$oid":"590ec9a69538cd26b8627e9c"},"title":"ADIDAS ПРОДОЛЖАЕТ УСКОРЯТЬ ТЕМПЫ РОСТА","image":"https://sneakerhead.ru/image/data/news/830273/tild6539-3433-4431-a334-656631616539__img_001.jpg","author":"kozya","content":"У adidas намечается отличное начало года. Продажи бренда в первом финансовом квартале увеличились на 18,9% и составили 6,04 млрд. долларов США. Этот рост также означает, что операционная прибыль немецкого спортивного гиганта выросла на 28,8% до 637, 3 млн. долларов США. Такое увеличение обусловлено растущим объемом продаж во всех регионах мира (кроме России). Особенно сильно рост интереса к продукции adidas вырос в Северной Америке (на 31%) и Китае (на 30%). \n\nРассуждая об этих цифрах, исполнительный директор adidas Group, Каспер Рорстед, сказал, что лучше такой рост популярности объясняется тем, что «потребительский спрос на наши продукты был замечен абсолютно во всех регионах». Эта новость появилась после рекордного для немецкого бренда 2016-го года, который можно смело называть самым удачным годом в современной истории adidas. \n\nПо словам эксперта по кроссовкам и аналитика спортивной индустрии из NPD Мэтта Пауэлла главными «локомотивами» такого роста стали всего 5 моделей кроссовок: Superstar, NMD, Tubular, Alpha Bounce и Stan Smith. ","summary":"У adidas намечается отличное начало года. Продажи бренда в первом финансовом квартале увеличились на 18,9% и составили 6,04 млрд. долларов США. Этот рост также означает, что операционная прибыль немецкого спортивного гиганта выросла на 28,8% до 637, 3 млн. долларов США. Такое увеличение обусловлено растущим объемом продаж во всех регионах мира (кроме России). Особенно сильно рост интереса к продукции adidas вырос в Северной Америке (на 31%) и Китае (на 30%). \n\nРассуждая об этих цифрах, исполнительный директор adidas Group, Каспер Рорстед, сказал, что лучше такой рост популярности объясняется т","createdAt":{"$date":"2017-05-07T07:15:50.246Z"},"tags":["adidas"," news"],"__v":0}
{"_id":{"$oid":"590eca859538cd26b8627e9d"},"title":"AIR JORDAN XI. ЯВЛЕНИЕ ЛЕГЕНДЫ","image":"https://sneakerhead.ru/image/data/news/828867/tild3836-6230-4364-a432-623031353465__1904581o_19kq79bia128397uvmm3h1eoj7full.png","author":"kozya","content":"Сезон 94-95. Майкл объявляет о возвращении и выходит с Чикаго в плей-офф. Первый раунд. Шарлотт. Джордан и компания начинают очень бодро и выбивают «шершней». В следующем раунде им должны были противостоять молодые и дерзкие Орландо, ведомые Шакилом О'нилом и Пенни Хардуэйем, которые выглядели на тот момент чуть ли не главными претендентами на чемпионство. Многие считают, что это противостояние было небольшой проверкой величия Майкла Джордана, которую он, к величайшему сожалению для фанатов Буллс, завалил. \nСерия выдалась очень жаркая и напряженная. Величие и опыт против силы и молодого задора. Лед и пламень. В таких напряженных ситуациях всегда бремя самой важной атаки, самого важного паса, всего самого важного переваливается на главную звезду команды. Майкл Джордан знал об этом, но что-то пошло не так.\n\n91:90 в пользу Буллс за 18 секунд до конца матча. Атака Буллс. Казалось, что лучше ситуации не придумать. Вот она победа, которая так нужна Майклу, чтобы заткнуть всех критиков. Надо лишь хорошо отыграть 18 секунд. Джордан получает мяч и начинает выводить, но абсолютно неожиданно для всех он его теряет под давлением защитника. Орландо в быстрой атаке забивает два очка. 91:92 за 6 секунд до конца. Джордан решается на рискованную передачу, которая не достигает цели. Этот пас, который потом назовут «странствующим», стал белым флагом.\nЧикаго проиграло 91:94, а миллионы телезрителей увидели 2 грубейших ошибки за 18 секунд, которые по-настоящему заставили засомневаться в величии Майкла. Все-таки полтора года без баскетбола даже для такого атлета — это очень большой перерыв. В итоге, серия осталась за Орландо (4:2), а Чикаго с позором были отправлены назад в родной Иллинойс. Майкл Джордан набирал в среднем по 30 очков за матч в этом противостоянии, но как сказал Ник Андерсон: «Это был не тот Майкл, которого все боялись.»\nПричем здесь кроссовки? Они играли небольшую, но крайне заметную роль в этом противостоянии, но об этом знают немногие. Тинкеру Хэтфилду опять поставили задачу сделать кроссовки для Джордана. Проектирование и создание первых семплов началось еще в начале 1995-ого года, а финальные макеты были готовы к матчам с Орландо. Тинкер перед серией с Мэджик решил презентовать Джордану новинку. Первый пробник Майклу очень понравился. Это была тестовая версия Air Jordan XI в расцветке 'Concord'.\nНе смотря на все запреты Тинкера, Джордан решил протестировать эту модель в матче, чем сильно поразил всех — никто не ждал, что он выйдет в новых кроссовках, которые вообще никогда до этого не появлялись. После двух игр в этих кроссовках НБА выписывает ему штраф в 5000 баксов за цветовое несоответствие модели и игровой формы. В те годы игроки Чикаго обязаны были играть в полностью черных кроссовках. На следующие игры Джордан решил надеть кроссовки из линейки Пенни Хардуэйя — Nike Air Flight One, но он внес одно очень важное изменение — сорвал нашивку с логотипом Анферни и выбросил ее, чтобы деморализовать соперника, но, как вы знаете, у него ничего не вышло.\nПримечательно, что в этой же серии появилась еще одна расцветка одиннадцатых — Black/White, которую сейчас называют 'Space Jam' (фильм тогда еще не начали снимать, поэтому такого названия у них не было). Тогда он надел их всего на 2 игры и больше в НБА в них не выступал. Когда начался сезон легендарный сезон 95-96 Джордан на руках имел уже финальную версию «одиннадцатых», которая моментально стала хитом продаж. А что было дальше вы знаете сами. 72-10. Победа в финале НБА. Звание величайшей команды в истории баскетбола. Так появились легендарные Air Jordan XI.","summary":"Сезон 94-95. Майкл объявляет о возвращении и выходит с Чикаго в плей-офф. Первый раунд. Шарлотт. Джордан и компания начинают очень бодро и выбивают «шершней». В следующем раунде им должны были противостоять молодые и дерзкие Орландо, ведомые Шакилом О'нилом и Пенни Хардуэйем, которые выглядели на тот момент чуть ли не главными претендентами на чемпионство. Многие считают, что это противостояние было небольшой проверкой величия Майкла Джордана, которую он, к величайшему сожалению для фанатов Буллс, завалил. \nСерия выдалась очень жаркая и напряженная. Величие и опыт против силы и молодого задора","createdAt":{"$date":"2017-05-07T07:19:33.727Z"},"tags":["jordanxii"," jordan"],"__v":0}
{"_id":{"$oid":"590ecb149538cd26b8627e9e"},"title":"NIKE AIR SOCK RACER - КРОССОВКИ, ОПЕРЕДИВШИЕ ВРЕМЯ","image":"https://sneakerbardetroit.com/wp-content/uploads/2017/04/nike-air-sock-racer-ultra-flyknit-release-date-12.jpg","author":"kozya","content":"Первоначально выпущенные в 1986-ом для марафонцев Nike Air Sock Racer опередили свое время. Эти кроссовки проложили путь к инновационным решениям Nike, которые позднее повлияли на всю индустрию кроссовок. Кроссовки были выполнены из эластичного синтетического материала, хорошо облегающего ногу. Фиксация ноги производилась за счет специальных застежек. Эти застежки стали предшественником технологии Nike Flyknit. Тонкая перфорированная подошва из мягкого пенного материала так же опередила время. Позже такая подошва легла в основу технологии Nike Free. Спроектировал модель Брюс Килгор. \n\nСпустя 31 год кроссовки возвращаются, чтобы напомнить всем, что дизайн и комфорт могут идти рука об руку даже в спортивной обуви. Сегодняшняя версия Nike Air Sock Racer Ultra Flyknit привносит новшества оригинальной модели модели в 2017-ый год. Верх выполнен из материала Flyknit, что повышает уровень воздухопроницаемости и степени комфорта. Фиксация осталась точно такой же — по две петли-застежки на каждый кроссовок. Подошва выполнена по образу технологии Nike Free и снабжена воздушными баллонами для лучше амортизации. ","summary":"Первоначально выпущенные в 1986-ом для марафонцев Nike Air Sock Racer опередили свое время. Эти кроссовки проложили путь к инновационным решениям Nike, которые позднее повлияли на всю индустрию кроссовок. Кроссовки были выполнены из эластичного синтетического материала, хорошо облегающего ногу. Фиксация ноги производилась за счет специальных застежек. Эти застежки стали предшественником технологии Nike Flyknit. Тонкая перфорированная подошва из мягкого пенного материала так же опередила время. Позже такая подошва легла в основу технологии Nike Free. Спроектировал модель Брюс Килгор. \n\nСпустя 3","createdAt":{"$date":"2017-05-07T07:21:56.222Z"},"tags":["nike"," sockracer"],"__v":0}
{"_id":{"$oid":"590ecb9c9538cd26b8627e9f"},"title":"DEAL X REEBOK INSTAPUMP FURY “TAI CHI” FEATURES A YIN \u0026 YANG COLOR BLOCK","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/deal-reebok-instapump-fury-tai-chi-yin-yang-1.jpg","author":"kozya","content":"Chinese sneaker shop DEAL teams up with Reebok for a very special “Tai Chi” edition of the Instapump Fury. Continuing the tradition of bold colorways for the unique silhouette, the Fury receives an eye-catching “Yin and Yang” color block with the two opposite shoes mirroring eachother’s high contrast black and white color block, inspired by Tai Chi’s “I have you, you have me” concept. The insoles feature a graphic of the traditional Tai Chi gossip compass, Yin \u0026 Yang logos are found embroidered on each heel to complete the impressive look. The collab arrives soon at DEAL locations in China. A global release at select Reebok Classic retailers can also be expected later this summer.","summary":"Chinese sneaker shop DEAL teams up with Reebok for a very special “Tai Chi” edition of the Instapump Fury. Continuing the tradition of bold colorways for the unique silhouette, the Fury receives an eye-catching “Yin and Yang” color block with the two opposite shoes mirroring eachother’s high contrast black and white color block, inspired by Tai Chi’s “I have you, you have me” concept. The insoles feature a graphic of the traditional Tai Chi gossip compass, Yin \u0026 Yang logos are found embroidered on each heel to complete the impressive look. The collab arrives soon at DEAL locations in China. A ","createdAt":{"$date":"2017-05-07T07:25:00.981Z"},"tags":["reebok"," instapump"," yinyang"," collab"," reebokdeal"],"__v":0}
{"_id":{"$oid":"590ee7855461e52afc314189"},"title":"J.CREW’S ESPRESSO-INSPIRED NEW BALANCE 997 COLLABORATION DROPS THIS SATURDAY","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/03/j-crew-new-balance-997-cortado-2.jpg","author":"kozya","content":"J.Crew and New Balance have been a match made in collaborative heaven for quite some time now. The menswear sensibilities of J.Crew have given us a number of premium revamps on some of New Balance’s most iconic running creations and now it’s the New Balance 997‘s turn to get a collaborative twist from the shop, this time taking inspiration from J.Crew designers’ favorite espresso drink, the Cortado. Available only at select J.Crew locations and online this coming Saturday, the J.Crew New Balance 997 Cortado features premium light tan suede throughout while a dark grey midsection skips out on the usual reflective 3M branding for a premium vachetta tan-colored ‘N’. Simple and refined light grey shades on the tongue and heel match a white midsole while a classic gum outsole adds a simple finish. Check out a detailed look at the coming J.Crew New Balance 997 Cortado below and grab your pair this Saturday, March 25th at J.Crew online and in-store. And check out the official site for the 997 Cortado.","summary":"J.Crew and New Balance have been a match made in collaborative heaven for quite some time now. The menswear sensibilities of J.Crew have given us a number of premium revamps on some of New Balance’s most iconic running creations and now it’s the New Balance 997‘s turn to get a collaborative twist from the shop, this time taking inspiration from J.Crew designers’ favorite espresso drink, the Cortado. Available only at select J.Crew locations and online this coming Saturday, the J.Crew New Balance 997 Cortado features premium light tan suede throughout while a dark grey midsection skips out on t","createdAt":{"$date":"2017-05-07T09:36:33.228Z"},"tags":["newbalance","nb"],"__v":0}
