{"_id":{"$oid":"591c998784b56b0a84612f28"},"title":"HERE’S WHAT THE OFF-WHITE X AIR JORDAN 1 LOOKS LIKE ON-FEET","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/off-white-air-jordan-1-on-feet-look-01.jpg","author":"admin","content":"We already know that Virgil Abloh’s OFF-WHITE Air Jordan 1 will release for $350 USD, and we’ve seen the collaborative pair in detail and with alternate lime green laces during the Met Gala. So all that’s left is some great on-feet shots showcasing the avant-garde construction of Michael Jordan’s iconic 1985 “Chicago” colorway. We get just that today courtesy of @13thmessenger for Hypebeast as the lifestyle shots showcase the Swooshless medial side branded with OFF-WHITE for Nike; Beaverton, Oregon, USA stamps of approval; and floppy ankle collars with hidden “85” imprinted also in quotes. The oversized Swoosh branding matches misplaced lace eyelets and more for a unique twist on the classic Air Jordan 1, but are you a fan? Stay tuned for a Release Date in the near future right here on Sneaker News.","summary":"We already know that Virgil Abloh’s OFF-WHITE Air Jordan 1 will release for $350 USD, and we’ve seen the collaborative pair in detail and with alternate lime green laces during the Met Gala. So all that’s left is some great on-feet shots showcasing the avant-garde construction of Michael Jordan’s iconic 1985 “Chicago” colorway. We get just that today courtesy of @13thmessenger for Hypebeast as the lifestyle shots showcase the Swooshless medial side branded with OFF-WHITE for Nike; Beaverton, Oregon, USA stamps of approval; and floppy ankle collars with hidden “85” imprinted also in quotes. The","createdAt":{"$date":"2017-05-17T18:45:04.076Z"},"tags":["jordan","jordani","offwhite"],"__v":0}
{"_id":{"$oid":"591c9ad1216dd407209e6593"},"title":"RONNIE FIEG REVEALS KITH X ADIDAS SOCCER COLLECTION","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/ronnie-fieg-kith-adidas-soccer-collection-01.jpg","author":"admin","content":"Ronnie Fieg took to Twitter to introduce not 1, but 2 coming KITH adidas Soccer Collections in the near future. After sponsoring the KITH Cobras of the Bowery Premier League in New York City, Ronnie and adidas Soccer worked on a collaboration that would translate easily from the soccer field to the street. We already know that there’s a coming KITH x adidas ACE16+ Ultra Boost in the works rumored to be incredibly limited with under 500 pairs releasing, but today we also get a look at an upcoming model that lacks any Boost cushioning but retains a mid-top Primeknit upper similar to the ACE16+. The pair features pastel shades of light blue with premium touches of leather on the pull tabs in a contrasting beige. We’ll keep you updated on the particulars of the coming collaboration as soon as we get more information, but for now, check out how the collaborative effort came about below via Ronnie’s post.","summary":"Ronnie Fieg took to Twitter to introduce not 1, but 2 coming KITH adidas Soccer Collections in the near future. After sponsoring the KITH Cobras of the Bowery Premier League in New York City, Ronnie and adidas Soccer worked on a collaboration that would translate easily from the soccer field to the street. We already know that there’s a coming KITH x adidas ACE16+ Ultra Boost in the works rumored to be incredibly limited with under 500 pairs releasing, but today we also get a look at an upcoming model that lacks any Boost cushioning but retains a mid-top Primeknit upper similar to the ACE16+. ","createdAt":{"$date":"2017-05-17T18:47:45.928Z"},"tags":["adidas"],"__v":0}
{"_id":{"$oid":"591c9b449f912a243c12317b"},"title":"COOGI AND PUMA TO RELEASE SECOND CLYDE DROP ON MAY 25TH","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/puma-coogi-clyde-may-2017.jpg","author":"admin","content":"Bring back more 90s brands! We all collectively freaked out when we got word that Undefeated was teaming up with Patta and FUBU for a nostalgic 90s-centric take on the Puma Clyde. Now the Puma Clyde is helping resurrect another staple from that era: COOGI. The latest streetwear-ready collaboration from the German sportswear brand brings back the infamous Biggy co-signed COOGI sweater look to the Clyde with a premium construction featuring black leather upper with a patterned formstripe and lining matching metallic gold branding on the side panel and tongue. That particular pair will be priced at just $120 USD and even features 18K gold plated lace tips and eyelets. But if you’re looking to go full COOGI sweater from head-to-toe, there’s also a limited COOGI x Puma Clyde featuring a base made entirely of knit material for $200 USD. Check out the full apparel collection below and know that you can grab your favorite option this Saturday, May 20th from Foot Locker, Shiekh Shoes, and PUMA.com followed by a release of the black pair on May 25th.","summary":"Bring back more 90s brands! We all collectively freaked out when we got word that Undefeated was teaming up with Patta and FUBU for a nostalgic 90s-centric take on the Puma Clyde. Now the Puma Clyde is helping resurrect another staple from that era: COOGI. The latest streetwear-ready collaboration from the German sportswear brand brings back the infamous Biggy co-signed COOGI sweater look to the Clyde with a premium construction featuring black leather upper with a patterned formstripe and lining matching metallic gold branding on the side panel and tongue. That particular pair will be priced ","createdAt":{"$date":"2017-05-16T08:13:00.000Z"},"tags":["puma"],"__v":0}
{"_id":{"$oid":"591ca1acb97e2906746d9a5e"},"title":"Air Jordan 13 для гольфа","image":"https://sneakerhead.ru/image/data/news/882694/tild3162-3732-4630-b832-366136613832__http2f2fhypebeastcom2fimage2f20172f052fnikeairjordan13golf4.jpg","author":"admin","content":"Майкл Джордан — большой фанат гольфа. После завершения карьеры он начал так часто катать мячи по зеленому газону, что решил сделать свою линейку кроссовок для гольфа, но это будут не какие-то новые силуэты, а классические модели Jordan Brand. Винтажные кроссовки Майкла просто немного доработали и пересадили на специальную подошву, приспособленную для игры в гольф.\n\nРаннее были фотографии переработанных первых номерных, которые достались только Майклу, но вот сегодня появились небольшие промо фотографии Air Jordan 13 для игры в гольф. Эти кроссовки уже скоро поступят в продажу. Готовьте 200 баксов и ставьте напоминалку на 18-ое мая.\n\nНо скорее всего контакт с клюшкой для гольфа у вас случался не на зеленых полях гольф-клубов, а в ГТА, где ей можно было дубасить все подряд, поэтому просто посмотрите на фотки и запомните, что такие кроссовки существуют. ","summary":"Майкл Джордан — большой фанат гольфа. После завершения карьеры он начал так часто катать мячи по зеленому газону, что решил сделать свою линейку кроссовок для гольфа, но это будут не какие-то новые силуэты, а классические модели Jordan Brand. Винтажные кроссовки Майкла просто немного доработали и пересадили на специальную подошву, приспособленную для игры в гольф.\n\nРаннее были фотографии переработанных первых номерных, которые достались только Майклу, но вот сегодня появились небольшие промо фотографии Air Jordan 13 для игры в гольф. Эти кроссовки уже скоро поступят в продажу. Готовьте 200 бак","createdAt":{"$date":"2017-05-17T19:17:00.598Z"},"tags":["jordan","golf"],"__v":0}
{"_id":{"$oid":"591ca1edb97e2906746d9a5f"},"title":"Новая система релизов от Sneakersnstuff","image":"https://sneakerhead.ru/image/data/news/896372/tild6536-3933-4262-b564-363438346232__20170517050143.jpg","author":"admin","content":"Сегодня, 17-го мая, состоялся долгожданный релиз коллаборации шведского магазина кроссовок Sneakersnstuff и adidas. В рамках этого сотрудничества был создан 'Datamosh pack', в который вошли сразу две расцветки adidas NMD_R1. Анонс этого релиза вызвал так много хайпа, что магазин пошел на беспрецедентные меры и придумал новую систему релизов. \n\nСегодня в 15:00 по шведскому времени в официальном инстаграмме магазина была запущена онлайн трансляция, где сотрудники публиковали уникальные ссылки на покупку пары. Одна ссылка — одно право покупки. Скорее всего, урвать себе пару таким образом было почти нереально. Непривычная форма релиза модели, которая может привлечь очень много новых покупателей. Шаг интересный. \n\nТакже сотрудники Sneakersnstuff подготовили специальную инфографику, в которой рассказывают, что надо сделать, чтобы купить желанные кроссовки. ","summary":"Сегодня, 17-го мая, состоялся долгожданный релиз коллаборации шведского магазина кроссовок Sneakersnstuff и adidas. В рамках этого сотрудничества был создан 'Datamosh pack', в который вошли сразу две расцветки adidas NMD_R1. Анонс этого релиза вызвал так много хайпа, что магазин пошел на беспрецедентные меры и придумал новую систему релизов. \n\nСегодня в 15:00 по шведскому времени в официальном инстаграмме магазина была запущена онлайн трансляция, где сотрудники публиковали уникальные ссылки на покупку пары. Одна ссылка — одно право покупки. Скорее всего, урвать себе пару таким образом было поч","createdAt":{"$date":"2017-05-17T19:18:05.308Z"},"tags":["sneakersnstuff"],"__v":0}
{"_id":{"$oid":"591ca308b97e2906746d9a60"},"title":"JORDAN 101: IS THE AIR JORDAN XI THE GREATEST SNEAKER EVER?","image":"https://sneakernews.com/wp-content/uploads/2015/12/jordan-11-bred1.jpg","author":"admin","content":"If there is one Air Jordan model that the average non-sneaker-loving joe on the street can identify, it’s probably the Air Jordan XI. There’s no doubt that the patent leather clad model from Michael Jordan and Tinker Hatfield is one of the most iconic and revered shoes ever, sure to cause a frenzy whenever it releases. Popular since the moment it debuted in 1995, the XI has only gained momentum in the last twenty years, as it’s now considered by many as the greatest basketball shoe of all time. In case you don’t already know everything about the Air Jordan XI, we’re here with another edition of Jordan 101 to get you educated. Continue reading for all the pertinent facts of the most legendary sneaker of them all.\nTHE DEBUT\nThe Air Jordan XI made its world debut on May 7, 1995 when Michael Jordan wore the “Concord” colorway for Game 1 of the Eastern Conference Finals versus the Orlando Magic. The shoe caught attention right from the beginning, thanks to the glossy patent leather upper that was unlike anything seen on court up to that point. The shoe also received media coverage after the NBA had issues with it not meeting the uniform guidelines since its predominantly white upper didn’t match the black sneakers the rest of the Bulls were wearing for the playoffs. This only increased the buzz around the shoe, beginning its long and storied history. After the NBA took exception to the Concord colorway, for the rest of the series Michael switched to the black colorway we now know as “Space Jam”—thanks to its appearance in the beloved movie.\nTHE BASICS\nAfter Michael premiered the Air Jordan XI in May of 1995, the world got their chance at the shoe beginning in the 1995 holiday shopping season. The debut retail release was the white and black “Concords”, followed by the “Bred” and “Columbia” colorways in 1996. Although Michael wore the black “Space Jam” version in the ‘95 playoffs, the colorway never released at retail until it retroed in 2000 to the delight of Jordan collectors. 2000 and 2001 would prove to be big years for the XI, as the new “Cool Grey” colorway dropped along with the first retros of all three OG colorways and the first low-top iterations of the shoe for both men and women.\nTINKER’S FAVORITE\nWhen the man who’s crafted pretty much every one of Nike’s most popular shoes names the Air Jordan XI as his favorite design ever, that’s really saying something. Indeed another one of Tinker Hatfield’s greatest hits, the Air Jordan XI was designed by Nike’s sneaker genius, ranking right up there in importance and world-wide appeal as models like the Air Max 1, Air Jordan III, and Air Tech Challenge II. Is the Air Jordan XI really the best sneaker ever designed by Tinker? That’s up to your own opinion, but its high praise from the man himself makes it almost undebatable.\nPATENT LEATHER\nThe clean lines and overall design of the Air Jordan XI are great no matter what, but would it be the same legendary sneaker without the patent leather? Without a doubt its most important design characteristic, the glossy patent leather debuted on the XI and would go on to become one of the signature motifs of Jordan Brand throughout the years, just like elephant print and clear outsoles. Arguably even overused at some times by Jordan Brand, patent leather is a crucial piece of the brand’s design language, and it all began with the XI.\nTECH\nAnother one of Tinker’s perfect balances of performance and style, the Air Jordan XI was the first Jordan model to feature a carbon fiber midfoot support shank, a technology that would be utilized in almost every game shoe to follow (Reebok actually beat Nike to the support shank concept with their Graphlite plate in shoes like the Instapump Fury and Shaq Attaq). Up top, the shoe also introduced durable and breathable ballistic nylon mesh to basketball shoes. The XI featured a full-length encapsulated Air unit for cushioning, marking the last Jordan shoe to use standard Air after the XII would debut Zoom Air to the Jordan line a year later. Recalling an important detail of Air Jordans V and VI, clear rubber was back on the outsole in a larger dose than ever to complete the XI’s remarkable design.\nIE\nAlong with the standard Air Jordan, the shoe also originally released in a low-top edition dubbed the Air Jordan XI Low IE with a varied patent leather-less construction. The red-headed stepchild of the Air Jordan XI, the low-top featuring elephant print (for the OG’s, only the white colorway had elephant print, but retro versions of the black/red pair also have it) and die-cut mesh paneling has always been kind of a mysterious member of the Air Jordan family. In fact, nobody can even officially confirm what IE stands for. Despite its peculiarities, the IE was actually worn on court by Michael Jordan in 1996 and has had success as a retro release throughout the years.\nMJ’S BEST SEASON IN HIS BEST SHOE\nExtending the Air Jordan XI’s legendary status, it just so happened to be the shoe Michael Jordan wore during his and the Bull’s historic record-breaking 72-win season in 1995-96. Worn by Michael all the way to a championship victory in the ‘96 Finals, the XI was there every step of the way for MJ’s incredible season where he earned the trifecta of regular season, All-Star, and Finals MVP honors to go along with his fourth championship ring. Oh yeah, he was also on the All-NBA and Defensive 1st teams for the 1995-96 season and led the league in scoring. Not bad.","summary":"If there is one Air Jordan model that the average non-sneaker-loving joe on the street can identify, it’s probably the Air Jordan XI. There’s no doubt that the patent leather clad model from Michael Jordan and Tinker Hatfield is one of the most iconic and revered shoes ever, sure to cause a frenzy whenever it releases. Popular since the moment it debuted in 1995, the XI has only gained momentum in the last twenty years, as it’s now considered by many as the greatest basketball shoe of all time. In case you don’t already know everything about the Air Jordan XI, we’re here with another edition o","createdAt":{"$date":"2017-05-17T19:22:48.761Z"},"tags":["jordan","jordanxi"],"__v":0}
{"_id":{"$oid":"591ca3dcb97e2906746d9a61"},"title":"THE NEXT WAVE OF NIKE AIR PRESTOS ARE HITTING STORES NOW","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2016/03/nike-air-presto-black-white-spring-2016-01.jpg","author":"admin","content":"It’s Nike Air Presto season, which means the t-shirt for your feet is going to be arriving at retailers in a number of awesome colorways throughout the next couple of months. After a detailed look at the Racer Blue option that featured a traditional dose of neoprene throughout the upper, today we get a look at a bolstered yet breathable mesh offering. A simple Black/Neutral Grey-White aesthetic keeps things stripped down to the essentials, as the unique overlay dons a milky translucence to match the brief shades of Neutral Grey throughout. Pairs are available right now from select shops like Rock City Kicks for $120 USD.","summary":"It’s Nike Air Presto season, which means the t-shirt for your feet is going to be arriving at retailers in a number of awesome colorways throughout the next couple of months. After a detailed look at the Racer Blue option that featured a traditional dose of neoprene throughout the upper, today we get a look at a bolstered yet breathable mesh offering. A simple Black/Neutral Grey-White aesthetic keeps things stripped down to the essentials, as the unique overlay dons a milky translucence to match the brief shades of Neutral Grey throughout. Pairs are available right now from select shops like R","createdAt":{"$date":"2017-05-17T19:26:20.516Z"},"tags":["nike","airpresto"],"__v":0}
{"_id":{"$oid":"591ca464b97e2906746d9a62"},"title":"JORDAN FUTURE LOW \"COOL GREY\"","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/Air-Jordan-Future-Low-cool-Grey-mesh-2.jpg","author":"admin","content":"Attention: the Cool Grey Jordans are a available! OK, so they’re not those Cool Greys, but they are the closest thing to the famous Air Jordan 11 you’re going to get this summer. We’re talking about the Air Jordan Future Low, sporting a light and breathable Cool Grey mesh upper on top of a solid white sole. So keep your 11s crispy and rock these Cool Greys all summer by picking up a pair now at select Jordan Brand retailers like Sneaker Politics.","summary":"Attention: the Cool Grey Jordans are a available! OK, so they’re not those Cool Greys, but they are the closest thing to the famous Air Jordan 11 you’re going to get this summer. We’re talking about the Air Jordan Future Low, sporting a light and breathable Cool Grey mesh upper on top of a solid white sole. So keep your 11s crispy and rock these Cool Greys all summer by picking up a pair now at select Jordan Brand retailers like Sneaker Politics.","createdAt":{"$date":"2017-05-17T19:28:36.972Z"},"tags":["jordan","future"],"__v":0}
{"_id":{"$oid":"591ca4cfb97e2906746d9a63"},"title":"AIR JORDAN FUTURE PREMIUM \"BLACK\" – RELEASE REMINDER","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/air-jordan-future-prm-black-gum-white-nikestore-021-620x405.jpeg","author":"admin","content":"As the first calendar year that has featured the Air Jordan Future comes to a close, we now know that this Air Jordan 11 inspired silhouette isn’t going anywhere anytime soon. Having grown immensely in affinity throughout the sneaker community, while also maturing on its own accord, models like the Air Jordan Future Premium “Black” are the top of the line today, but truly only the beginning for this budding new style. Will you be picking up a pair? Give them an addition look after the break and check for this PRM Future at select retailers and eBay.Air Jordan Future PRM\nColor: Black/Gum Yellow-Sail\nStyle Code: 652141-019\nRelease Date: 11/29/14\nPrice: $375","summary":"As the first calendar year that has featured the Air Jordan Future comes to a close, we now know that this Air Jordan 11 inspired silhouette isn’t going anywhere anytime soon. Having grown immensely in affinity throughout the sneaker community, while also maturing on its own accord, models like the Air Jordan Future Premium “Black” are the top of the line today, but truly only the beginning for this budding new style. Will you be picking up a pair? Give them an addition look after the break and check for this PRM Future at select retailers and eBay.Air Jordan Future PRM\nColor: Black/Gum Yellow","createdAt":{"$date":"2017-05-17T19:30:23.153Z"},"tags":["jordan","future","futurepremium"],"__v":0}
{"_id":{"$oid":"591ca5f8b97e2906746d9a64"},"title":"NIKE VAPORMAX \"DARK TEAM RED\" RELEASES ON JUNE 20TH","image":"https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/nike-vapormax-dark-team-red-release-date-849558-601-01.jpg","author":"admin","content":"What’s next for the Nike VaporMax? We already know that Nike has a wave of new colorways planned for Summer 2017 and you can check all of those out via our updated Nike VaporMax – Summer 2017 Preview post. Next on the list will be the Nike VaporMax “Day to Night” Collection on June 1st followed by this new Nike VaporMax Dark Team Red offering on June 20th. This pair will definitely be a hit thanks to the Burgundy-like appearance throughout with contrasting University Red hints on the Dynamic Flywire and Flyknit speckling. Nike even manages to update that head-turning Air Max outsole unit with a smoky black appearance to match the Swoosh branding. What do you think of the look? Check out more of the VaporMax Dark Team Red colorway below and be sure to stay updated on all of the latest Release Dates right here on Sneaker News.","summary":"What’s next for the Nike VaporMax? We already know that Nike has a wave of new colorways planned for Summer 2017 and you can check all of those out via our updated Nike VaporMax – Summer 2017 Preview post. Next on the list will be the Nike VaporMax “Day to Night” Collection on June 1st followed by this new Nike VaporMax Dark Team Red offering on June 20th. This pair will definitely be a hit thanks to the Burgundy-like appearance throughout with contrasting University Red hints on the Dynamic Flywire and Flyknit speckling. Nike even manages to update that head-turning Air Max outsole unit with ","createdAt":{"$date":"2017-05-17T20:36:59.576Z"},"tags":["nike","vapormax"],"__v":0}
