[
  {
    "id": "titivukSat Apr 29 2017 01:09:05 GMT+0300 (RTZ 2 (зима))",
    "title": "ADIDAS ULTRA BOOST ATR MID RELEASING IN KHAKI",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/adidas-ultra-boost-mid-atr-oxford-tan-5.jpg",
    "author": "titivuk",
    "content": "The adidas Ultra Boost ATR Mid has yet to release in stores, but we’re getting some advanced looks at some colorways that you can expect to hit retail. This khaki pair is the latest to surface, as it comes packaged with a tonal heel cup, black Primeknit embedded into the upper, and a black ankle rim. A release date for the Ultra Boost Mid has yet to be confirmed, but we expect a late Summer/early Fall release as the model itself is more fitting for that time of year. Enjoy a detailed look ahead and stay tuned for release updates.",
    "tags": [
      "adidas",
      " ultraboost",
      " khaki"
    ],
    "summary": "The adidas Ultra Boost ATR Mid has yet to release in stores, but we’re getting some advanced looks at some colorways that you can expect to hit retail. This khaki pair is the latest to surface, as it comes packaged with a tonal heel cup, black Primeknit embedded into the upper, and a black ankle rim. A release date for the Ultra Boost Mid has yet to be confirmed, but we expect a late Summer/early Fall release as the model itself is more fitting for that time of year. Enjoy a detailed look ahead and stay tuned for release updates.",
    "createdAt": "2017-04-28T22:14:48.970Z",
    "_id": "09f236b4f2b14cde9625d284bcc05568"
  },
  {
    "id": "titivukSat Apr 29 2017 01:38:29 GMT+0300 (RTZ 2 (зима))",
    "title": "SNEAKER CON RETURNS TO THE BAY AREA THIS SATURDAY, APRIL 29TH",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/sneaker-con-bay-area-april-29th-620x427.jpg",
    "author": "titivuk",
    "content": "Heads up, Bay Area sneakerheads! The world’s greatest traveling sneaker trade show, Sneaker Con, arrives at the Santa Clara Convention Center this Saturday, April 29th. All of the best features that come with each Sneaker Con stop will be included like the Trading Pit, Ace of Customs contest, and Legit Check for all of the latest releases that you’re looking to cop over the weekend.",
    "tags": [
      "sneakercon"
    ],
    "summary": "Heads up, Bay Area sneakerheads! The world’s greatest traveling sneaker trade show, Sneaker Con, arrives at the Santa Clara Convention Center this Saturday, April 29th. All of the best features that come with each Sneaker Con stop will be included like the Trading Pit, Ace of Customs contest, and Legit Check for all of the latest releases that you’re looking to cop over the weekend.",
    "createdAt": "2017-04-28T22:38:29.069Z",
    "_id": "5d778cab1ef34daf9546844e2d0fab23"
  },
  {
    "id": "titivukSat Apr 29 2017 01:39:37 GMT+0300 (RTZ 2 (зима))",
    "title": "ADIDAS BUSENITZ PRO GOES ULTRA PREMIUM IN HORWEEN LEATHER",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/adidas-Busenitz_Horween-1.jpg",
    "author": "titivuk",
    "content": "The adidas Skateboarding Busenitz Pro has been made over in premium constructions before, but never quite like this. Perhaps the most luxurious edition of the modern classic skate shoe ever, the Dennis Busenitz signature model gets an ultra premium bison leather upper by renowned Chicago tannery Horween Leather Company. The soft and supple textured leather is presented in a tonal deep burgundy shade with embossed branding, while a semi-translucent gum sole, additional leather lining, and waxed laces all add the perfect final touches. The Busenitz Pro Horween will be available at specialty adidas retailers worldwide starting May 1st for $120.",
    "tags": [
      "adidas",
      " busenits",
      " release"
    ],
    "summary": "The adidas Skateboarding Busenitz Pro has been made over in premium constructions before, but never quite like this. Perhaps the most luxurious edition of the modern classic skate shoe ever, the Dennis Busenitz signature model gets an ultra premium bison leather upper by renowned Chicago tannery Horween Leather Company. The soft and supple textured leather is presented in a tonal deep burgundy shade with embossed branding, while a semi-translucent gum sole, additional leather lining, and waxed laces all add the perfect final touches. The Busenitz Pro Horween will be available at specialty adid",
    "createdAt": "2017-04-28T22:39:37.926Z",
    "_id": "3c5cabfc70714cb0875c88f7ce810b9f"
  },
  {
    "id": "titivukSat Apr 29 2017 01:42:23 GMT+0300 (RTZ 2 (зима))",
    "title": "THE NIKE SOCK DART BR IS AVAILABLE NOW IN FOUR COLORWAYS",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/nike-sock-dart-breathe-spring-2017-colorways-01.jpg",
    "author": "titivuk",
    "content": "The Nike Sock Dart is back and better than ever this Spring/Summer 2017 season thanks to some smart, modernized updates from Nike Sportswear. Not only have we seen the early 2000s running silhouette updated by some head-turning Safari Print options, but Nike is also transforming the once profound performance runner into a more lifestyle-friendly offering by introducing the Nike Sock Dart BR Monochrome Pack, available right now in 4 colorways. Sure, we’ve seen Triple Black Sock Darts in the past, and the Trooper Olive option here even looks like a holdover from the somewhat slept on Stone Island collaboration. But then there’s the most vibrant colorways of Arctic Orange (a shade we’ll continue to see throughout Spring 2017) and the standout Lemon Chiffon. Check out more detailed shots of each Nike Sock Dart BR Monochrome Pack colorway below and grab your favorite option today from select shops like KITH for $140 USD.",
    "tags": [
      "nike",
      " sockdart"
    ],
    "summary": "The Nike Sock Dart is back and better than ever this Spring/Summer 2017 season thanks to some smart, modernized updates from Nike Sportswear. Not only have we seen the early 2000s running silhouette updated by some head-turning Safari Print options, but Nike is also transforming the once profound performance runner into a more lifestyle-friendly offering by introducing the Nike Sock Dart BR Monochrome Pack, available right now in 4 colorways. Sure, we’ve seen Triple Black Sock Darts in the past, and the Trooper Olive option here even looks like a holdover from the somewhat slept on Stone Islan",
    "createdAt": "2017-04-28T22:42:23.113Z",
    "_id": "c8511610b0fc4549a79c4023dd98d09c"
  },
  {
    "id": "titivukSat Apr 29 2017 01:43:14 GMT+0300 (RTZ 2 (зима))",
    "title": "NIKE PATCHES TOGETHER MULTIPLE PRINTS FOR THE LATEST AIR FORCE 1 LV8",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/nike-air-force-1-low-823511-401.jpg",
    "author": "titivuk",
    "content": "Summertime and the Nike Air Force 1 Low is winning. Not only have collaborations from the likes of VLONE and upcoming team-ups with Supreme, CDG, and OFF WHITE catapulted the Air Force 1 back into the popular lexicon, but you can’t go wrong with such staples as the all-white lows for the hotter months. But if you’re looking for something a bit more creative from the Swoosh, this latest Air Force 1 Low Multi Print features an array of summer-ready hints in the form of Aztec graphics, contrast stitching throughout, a denim heel, hackeysack inspirations, and light blue touches on the midfoot and toe for one of the more unique AF1 general releases we’ve seen in quite some time. You won’t even have to be a college freshman after their first civics course to wear this pair. Check out more of this summer-themed Nike Air Force 1 Low below and stay tuned for more of the latest Nike Sportswear Release Dates right here on Sneaker News.",
    "tags": [
      "nike",
      " airforce"
    ],
    "summary": "Summertime and the Nike Air Force 1 Low is winning. Not only have collaborations from the likes of VLONE and upcoming team-ups with Supreme, CDG, and OFF WHITE catapulted the Air Force 1 back into the popular lexicon, but you can’t go wrong with such staples as the all-white lows for the hotter months. But if you’re looking for something a bit more creative from the Swoosh, this latest Air Force 1 Low Multi Print features an array of summer-ready hints in the form of Aztec graphics, contrast stitching throughout, a denim heel, hackeysack inspirations, and light blue touches on the midfoot and ",
    "createdAt": "2017-04-28T22:43:14.779Z",
    "_id": "a018709b4b9b4f14913c5135c0b66317"
  },
  {
    "id": "titivukSat Apr 29 2017 01:44:07 GMT+0300 (RTZ 2 (зима))",
    "title": "THE ADIDAS EQT RACING 91 RETURNS IN PRIMEKNIT UPPERS FOR SPRING",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/adidas-eqt-racing-91-pk-may-1st-releases-01.jpg",
    "author": "titivuk",
    "content": "The adidas EQT Racing 91 was a game changer when it first released during the adidas EQT heyday back in the early 90s. The women’s silhouette featured a slip-on construction with the entire midfoot cut out as if it were a slide for an incredible breezy ride while mesh inserts throughout helped the retro be as lightweight an installment as possible. The adidas EQT Racing 91 Primeknit was an obvious update given the unique cut-out shape that lent itself to the malleable woven construction, and now 2 new colorways are headed to retailers this Spring 2017. A coral light pink known as Haze Colar abides by the pink footwear trend seen throughout this spring season while a Mystery Blue showcases the unique woven patterns on the one-piece upper in direct contrast with the original EVA midsole. Grab your pair on May 1st via adidas.com.",
    "tags": [
      "adidas",
      " eqt",
      " woomen"
    ],
    "summary": "The adidas EQT Racing 91 was a game changer when it first released during the adidas EQT heyday back in the early 90s. The women’s silhouette featured a slip-on construction with the entire midfoot cut out as if it were a slide for an incredible breezy ride while mesh inserts throughout helped the retro be as lightweight an installment as possible. The adidas EQT Racing 91 Primeknit was an obvious update given the unique cut-out shape that lent itself to the malleable woven construction, and now 2 new colorways are headed to retailers this Spring 2017. A coral light pink known as Haze Colar ab",
    "createdAt": "2017-04-28T22:44:07.016Z",
    "_id": "d1aa1761851e460cb3a35f0e66b96e7b"
  },
  {
    "id": "titivukSat Apr 29 2017 01:44:49 GMT+0300 (RTZ 2 (зима))",
    "title": "SUPREME X NIKE “SUPTEMPO” RESTOCKING ON NIKE.COM?",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/supreme-nike-uptempo-nike-online-release.jpg",
    "author": "titivuk",
    "content": "Updated April 28th, 2017: The Supreme x Nike Air More Uptempo “Suptempo” releases again in three colorways on April 29th, 2017 for $190 via Nike.Supreme officially dropped the trio of “Suptempo” colorways this morning (the Japan release is this Saturday). Sizes are all gone, but you might be in for another shot. Official Nike images of all three colorways of the Supreme x Nike Air More Uptempo are currently live, which usually signifies a Nike.com release somewhere down the line. In addition, our sources close to Supreme say a release on Nike.com and potentially NikeLab 21 Mercer is in the books. Nothing is confirmed yet, but stay tuned for updates and see what’s available now on eBay.",
    "tags": [
      "nike",
      " supreme",
      " collab",
      " suptempo"
    ],
    "summary": "Updated April 28th, 2017: The Supreme x Nike Air More Uptempo “Suptempo” releases again in three colorways on April 29th, 2017 for $190 via Nike.Supreme officially dropped the trio of “Suptempo” colorways this morning (the Japan release is this Saturday). Sizes are all gone, but you might be in for another shot. Official Nike images of all three colorways of the Supreme x Nike Air More Uptempo are currently live, which usually signifies a Nike.com release somewhere down the line. In addition, our sources close to Supreme say a release on Nike.com and potentially NikeLab 21 Mercer is in the boo",
    "createdAt": "2017-04-28T22:44:49.662Z",
    "_id": "a07d93b610a94c8f9f6312bcf12d180b"
  },
  {
    "id": "titivukMon May 01 2017 00:23:12 GMT+0300 (RTZ 2 (зима))",
    "title": "PUMA RELEASES A BLAZE OF GLORY IN “OLIVE” COLORS",
    "image": "https://newsneakernews-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/puma-blaze-of-glory-olive-black-red-2.jpg",
    "author": "titivuk",
    "content": "The Puma Blaze of Glory receives another impeccable look this spring with this latest version in a mix of black, olive, and red. Always a great color combination, the three hues combine to form one tough-looking rendition of the Blaze of Glory, constructed in leather with mesh and suede detailing above the soft Trinomic-cushioned midsole. Arriving now overseas, these should hit finer Puma retailers in the USA soon.",
    "tags": [
      "puma",
      " blazeofglory"
    ],
    "summary": "The Puma Blaze of Glory receives another impeccable look this spring with this latest version in a mix of black, olive, and red. Always a great color combination, the three hues combine to form one tough-looking rendition of the Blaze of Glory, constructed in leather with mesh and suede detailing above the soft Trinomic-cushioned midsole. Arriving now overseas, these should hit finer Puma retailers in the USA soon.",
    "createdAt": "2017-05-04T20:10:54.304Z",
    "_id": "34f2f27e9d704dc59b6397fdcc6ed3e2"
  }
]